/*
    Повертає рядок, який містить форму нормалізації Unicode даного рядка.
    form? - One of "NFC", "NFD", "NFKC", or "NFKD" (def NFC)
 */

/*
    Діакретичні знаки - складаються з основного знаку та знаку над/під ним.
    Наприклад літера a - àáâäãåā.
    Більшість поширених “складених” символів мають власний код у таблиці Юнікод. Але не всі, тому що можливих комбінацій занадто багато.
    Щоб підтримувати довільні композиції, стандарт Юнікод дозволяє нам використовувати кілька символів Юнікод:
    базовий символ, за яким іде один або декілька символів-позначок, які “прикрашають” його.
    Це забезпечує велику гнучкість, але при цьому виникає цікава проблема:
    два символи можуть візуально виглядати однаково, але бути представлені різними композиціями Юнікоду.
    Щоб вирішити цю проблему, існує алгоритм “нормалізації Юнікоду”, який приводить кожен рядок до єдиної “нормальної” форми.
 */

let string1 = "\u00F1"; // ñ
let string2 = "\u006E\u0303"; // ñ
console.log(string1 === string2) // false
console.log(string1.length) // 1
console.log(string2.length) // 2


string1 = string1.normalize();
string2 = string2.normalize();
console.log(string1 === string2); // true
console.log(string1.length); // 1
console.log(string2.length); // 1
