// Math.E

/*
    Math.E представляє основу натурального логарифму.

    Натуральний логарифм — це логарифм за основою e,
    Де e — це особлива константа, приблизно рівна 2.71828. Відома вона як число Ейлера.
    Натуральний логарифм числа записується як ln x
 */

console.log(Math.E) // 2.718281828459045


/*
    use keys
 */

/*
    Експоненційний ріст та спад:
    В природі та соціальних науках багато процесів описуються експоненційними функціями.
    Наприклад, росту бактерій, процентна ставка в банку, розпад радіоактивних речовин.
 */

function exponentialGrowth(initialAmount, rate, time) {
    return initialAmount * Math.pow(Math.E, rate * time);
}

/*
    Постійне зростання:
    Коли щось зростає на постійний відсоток протягом певного періоду часу (наприклад, відсотки в банку),
    Процес цього зростання може бути описаний за допомогою e.
 */

function compoundInterest(principal, rate, timesCompounded, years) {
    return principal * Math.pow((1 + rate/timesCompounded), timesCompounded * years);
}

