/*
    Рядкове представлення числа, якому можна вказати кількість цифр після .
    При необхідності число округлюється, а дробова частина доповнюється нулями.
    Якщо абсолютне значення числа більше або дорівнює 10**21 використовує алгоритм toString і повертає експоненційний запис.
    digits? - кількість цифр після .
 */

const num = 12345.6789;

console.log(num.toFixed()); // '12346'
console.log(num.toFixed(1)); // '12345.7'
console.log(num.toFixed(6)); // '12345.678900'
console.log((1.23e20).toFixed(2)); // '123000000000000000000.00'
console.log((1.23e-10).toFixed(2)); // '0.00'
console.log((2.34).toFixed(1)); // '2.3'
console.log((2.35).toFixed(1)); // '2.4'
console.log((2.55).toFixed(1)); // '2.5'
console.log((2.449999999999999999).toFixed(1)); // '2.5'
console.log((6.02 * 10 ** 23).toFixed(50)); // 6.019999999999999e+23
console.log((-2.34).toFixed(1)); // '-2.3'
console.log(-2.34.toFixed(1)); // -2.3 ???
