let xyz = 123

/*
    У вас є рядок '123.456789'. Перетворіть цей рядок на число і округліть до трьох знаків після коми.
 */
// let res = Number(Number('123.456789').toFixed(3))


/*
    Ви отримали числове значення Infinity. Перевірте, чи є це значення кінцевим числом.
 */
// let res = Number.isFinite(Infinity)


/*
    Дано рядок '10005000'. Перетворіть цей рядок на число і представте у вигляді експоненціальної запису.
 */
// let res = Number('10005000').toExponential()


/*
    У вас є число 999. Перевірте, чи є це число цілим.
 */
// let res = Number.isInteger(999)


/*
    Ви маєте рядок '3.1415926535'. Перетворіть цей рядок на число і змініть точність до чотирьох знаків після коми.
 */
// let res = Number('3.1415926535').toFixed(4)


/*
    У вас є значення NaN. Перевірте, чи є це значення NaN.
 */
// let res = Number.isNaN(NaN)


/*
    Дано число 1234567890123456. Перевірте, чи є це число безпечним цілим числом.
 */
// let res = Number.isSafeInteger(1234567890123456)


/*
    У вас є число 45.6789. Переведіть це число у рядковий формат.
 */
// let res = (45.6789).toString()


/*
    Дано рядок ' 56.78'. Перетворіть цей рядок на число, видаливши пробіли на початку і в кінці.
 */
// let res = Number.parseFloat(' 56.78')


/*
    У вас є об'єкт Number(123). Отримайте примітивне значення цього об'єкта.
 */
// let res = new Number(123).valueOf()


/*
    Ви отримали числовий масив [123.456, 78.91011, 12.131415, 1617.1819].
    Перетворіть кожне число в рядок з точністю два знаки після коми.
 */
// let arr = [123.456, 78.91011, 12.131415, 1617.1819]
// for (let index = 0; index < arr.length; index++) {
//     arr[index] = arr[index].toFixed(2)
// }

/*
    У вас є число 9007199254740992. Перевірте, чи є це число безпечним цілим числом.
 */
// let res = Number.isSafeInteger(9007199254740992)


/*
    Ви отримали рядок '3.14 сплюсніть мене 2.71828'. Знайдіть усі числа в цьому рядку і знайдіть їхню суму.
 */
// let pArr = '3.14 сплюсніть мене 2.71828'.matchAll(/\d+(\.\d+)?/g)
// let arr = [...pArr]
// let sum = 0
// for(let index = 0; index < arr.length; index++) {
//     sum += +arr[index][0]
// }


/*
    Дано рядок '0xFF'. Перетворіть цей рядок у число в десятичній системі числення.
 */
// let res = Number.parseInt('0xFF', 16)


/*
    У вас є масив рядків ['123', '456', '789'].
    Перетворіть кожен елемент масиву в число і знайдіть їхнє середнє арифметичне.
 */
// let arr = ['123', '456', '789']
// function aM(arr) {
//     let counter = 0
//
//     for (let index = 0; index < arr.length; index++) {
//         counter += Number(arr[index])
//     }
//
//     return counter / arr.length
// }


/*
    Ви отримали числове значення -Infinity. Перевірте, чи є це значення NaN.
 */
// let res = Number.isNaN(-Infinity)


/*
    У вас є рядок з числом у двійковій системі числення: '1101'.
    Перетворіть цей рядок у число в десятичній системі числення.
 */
// let res = Number.parseInt('1101', 2)


/*
    У вас є число 123456789.987654321. Представте це число у вигляді експоненціальної запису.
 */
// let res = (123456789.987654321).toExponential()


/*
    Дано рядок ' 3.14 '. Перетворіть цей рядок на число, видаливши пробіли на початку і в кінці.
 */
// let res = Number(' 3.14 ')


/*
    У вас є рядок '3.14&-9.67&45.68&-0.007&78'.
    Розділіть цей рядок і знайдіть максимальне і мінімальне значення серед отриманих чисел.
 */
// let str = '3.14&-9.67&45.68&-0.007&78'
// let splittedStr = str.split('&')
// let min = Math.min(...splittedStr) // -9.67
// let max = Math.max(...splittedStr) // 78


/*
    Дано рядок '255255255255'. Розділіть цей рядок на чотири рівні частини,
    перетворіть їх у числа у шістнадцятковій системі числення і сконвертуйте їх назад у рядок,
    розділений крапками.
 */
// let str = '255255255255'
// function x(str) {
//     let arr = []
//     let from = 0
//     let to = str.length / 4
//     const toConst = to
//
//     for (let index = 0; index < 4; index++) {
//         arr[index] = Number.parseInt(str.slice(from, to), 16)
//         from += toConst
//         to += toConst
//     }
//     return arr.join('.')
// }


/*
    Ви отримали рядок '1a2b3c4d5e6f'. Знайдіть усі числа у цьому рядку і
    виведіть квадратний корінь з їхньої суми, округлений до найближчого цілого числа.
 */
// let str = '1a2b3c4d5e6f'
// let matchedElements = str.matchAll(/\d+(\.\d+)?/g)
// let arr = [...matchedElements]
// let total = 0
// for (let index = 0; index < arr.length; index++) {
//     total += Number(arr[index][0])
// }
// let res = Math.ceil(Math.sqrt(total)) // 5


/*
    У вас є рядок ' Hello World '. Видаліть пробіли на початку і в кінці рядка,
    а потім переверніть рядок так, щоб слова були в зворотньому порядку.
 */
// let res = ' Hello World '.trim().split(' ').reverse().join(' ')


/*
    Ви маєте число 12345.6789. Округліть число до трьох знаків після коми,
    а потім конвертуйте результат у рядок, де кожен символ розділений комою.
 */
// let num = (12345.6789).toFixed(3)
// let arr = num.toString().split('').join(',')


/*
    У вас є рядок 'abcdefgh'. Створіть новий рядок,
    використовуючи тільки символи з непарними індексами, та переведіть їх у верхній регістр.
 */
// let str = 'abcdefgh'
// let newStr = ''
// for (let index = 0; index < str.length; index++) {
//     if (index % 2 !== 0) {
//         newStr += str[index]
//     }
// }
// newStr = newStr.toUpperCase()


/*
    Ви отримали рядок '101&202&303&404'.
    Перетворіть цей рядок у масив чисел і знайдіть середнє арифметичне значення цих чисел.
 */
// let arr = '101&202&303&404'.split('&')
// let total = 0
// for (let index = 0; index < arr.length; index++) {
//     total += Number(arr[index])
// }
// total = total / arr.length


/*
    У вас є число 0.009876.
    Представте це число у вигляді експоненціальної запису
    та знайдіть позицію першої цифри після десяткової коми в отриманому рядку.
 */
// let res = (0.009876).toExponential()
// console.log(res.indexOf('.') + 1)


/*
    Ви отримали число -12345.6789. Знайдіть абсолютне значення цього числа,
    округліть його до цілого числа та перевірте, чи є результат парним числом.
 */
// let res = Math.round(Math.abs(-12345.6789)) % 2 === 0


/*
    У вас є рядок 'Lorem ipsum dolor sit amet'.
    Переверніть кожне слово в рядку та перевірте, чи входить підрядок 'mus' у результат.
 */
// let res = 'Lorem ipsum dolor sit amet'.split(' ').map(el => el.split('').reverse().join('')).join(' ').includes('mus')







